#+BEGIN_SRC sage
  load("~/work/rust/hilbert_qexp/hilbert_sqrt2/src/sage/mod_str.py")
#+END_SRC

#+RESULTS:

#+BEGIN_SRC sage :results table :colnames '("i" "parity" "Weights of generators" "Weights of relations")
  [[i] + ["even" if is_even(j) else "odd"] + load_cand_wts(i, j) for i in range(1, 21) for j in [0, 1]]
#+END_SRC

#+RESULTS:
|  i | parity | Weights of generators    | Weights of relations   |
|----+--------+--------------------------+------------------------|
|  1 | even   | [6, 8, 10]               | [12]                   |
|  1 | odd    | [5, 7]                   |                        |
|  2 | even   | [4, 6]                   |                        |
|  2 | odd    | [3, 7]                   |                        |
|  3 | even   | [4, 6, 8]                | [10]                   |
|  3 | odd    | [3, 5]                   |                        |
|  4 | even   | [2, 4]                   |                        |
|  4 | odd    | [5, 5, 7]                | [11]                   |
|  5 | even   | [4, 6, 6]                | [12]                   |
|  5 | odd    | [3, 5, 7]                | [11]                   |
|  6 | even   | [2, 4, 6]                | [10]                   |
|  6 | odd    | [3, 3, 5]                | [9]                    |
|  7 | even   | [4, 4, 6, 8]             | [10, 12]               |
|  7 | odd    | [3, 5, 5, 7]             | [9, 11]                |
|  8 | even   | [2, 4, 4, 6]             | [8, 10]                |
|  8 | odd    | [3, 5, 5, 7]             | [11, 11]               |
|  9 | even   | [2, 4, 6, 6]             | [10, 12]               |
|  9 | odd    | [3, 3, 5, 5]             | [9, 11]                |
| 10 | even   | [2, 4, 4, 6]             | [10, 12]               |
| 10 | odd    | [3, 3, 5, 5, 7]          | [9, 9, 11]             |
| 11 | even   | [4, 4, 4, 6, 6]          | [10, 10, 12]           |
| 11 | odd    | [3, 3, 5, 5, 7]          | [9, 11, 11]            |
| 12 | even   | [2, 2, 4, 4, 6]          | [8, 10, 10]            |
| 12 | odd    | [3, 3, 5, 5, 5]          | [9, 11, 11]            |
| 13 | even   | [2, 4, 4, 6, 6]          | [10, 12, 12]           |
| 13 | odd    | [3, 3, 5, 5, 5, 7]       | [9, 9, 11, 11]         |
| 14 | even   | [2, 4, 4, 4, 6, 6]       | [8, 10, 10, 12]        |
| 14 | odd    | [3, 3, 3, 5, 5, 7]       | [9, 9, 11, 11]         |
| 15 | even   | [2, 4, 4, 4, 6, 6]       | [10, 10, 10, 12]       |
| 15 | odd    | [3, 3, 3, 5, 5, 5]       | [9, 9, 11, 11]         |
| 16 | even   | [2, 2, 4, 4, 4, 6]       | [8, 10, 10, 12]        |
| 16 | odd    | [3, 3, 5, 5, 5, 5, 7]    | [9, 9, 11, 11, 11]     |
| 17 | even   | [2, 4, 4, 4, 6, 6, 6]    | [8, 10, 10, 12, 12]    |
| 17 | odd    | [3, 3, 3, 5, 5, 5, 7]    | [9, 9, 11, 11, 11]     |
| 18 | even   | [2, 2, 4, 4, 4, 6, 6]    | [8, 10, 10, 10, 12]    |
| 18 | odd    | [3, 3, 3, 3, 5, 5, 5]    | [9, 9, 9, 11, 11]      |
| 19 | even   | [2, 4, 4, 4, 4, 6, 6]    | [10, 10, 10, 12, 12]   |
| 19 | odd    | [3, 3, 3, 5, 5, 5, 5, 7] | [9, 9, 9, 11, 11, 11]  |
| 20 | even   | [2, 2, 4, 4, 4, 4, 6, 6] | [8, 8, 10, 10, 10, 12] |
| 20 | odd    | [3, 3, 3, 5, 5, 5, 5, 7] | [9, 9, 11, 11, 11, 11] |

#+BEGIN_SRC sage
  # alist of (i, dim S_{2, 2 + 2i}) using Magma
  dim_weight2_cusp_forms = [(1, 0), (2, 0), (3, 0), (4, 1), (5, 0), (6, 1), (7, 0), (8, 1), (9, 1), (
      10, 1), (11, 0), (12, 2), (13, 1), (14, 1), (15, 1), (16, 2), (17, 1), (18, 2), (19, 1), (20, 2)]
#+END_SRC

#+RESULTS:

Magmaの結果を信じるならば，weight (2, k) (kは3以上)のときの次元公式は正しい．
#+BEGIN_SRC sage
  all(cuspforms_dimension((2, 2 + 2*i)) == d for i, d in dim_weight2_cusp_forms)
#+END_SRC

#+RESULTS:
: True
